tests/data/SayHelloGreeting.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:ns1="http://localhost/SayHello/scheme">
    <SOAP-ENV:Body>
        <ns1:Greeting>
            <Message>Hello, John Doe</Message>
        </ns1:Greeting>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
