tests/data/SayHelloPerson.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:ns1="http://localhost/SayHello/scheme">
    <SOAP-ENV:Body>
        <ns1:Person>
            <FirstName>John</FirstName>
            <LastName>Doe</LastName>
        </ns1:Person>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
